let comp_magias = {"amedrontar":{"alcance":"Curto","alvo":"Animais e humanoides","circulo":1,"descricao":"Amedrontar (Padrão, 7 PM) Animais e humanoides a escolha do necromante em alcance curto ficam apavorados por 1d4+1 rodadas e depois abalados (Vontade reduz para abalado).","duracao":"1d4+1 rodadas e depois abalados","escola":"Necromancia","execucao":"Padrão (7 PM)","id":"amedrontar","nome":"Amendrontar","opcoes":[],"resistencia":"Vontade reduz para abalado","tipo":"Arcana"},"armaduraArcana":{"alcance":"Pessoal","alvo":"NA","circulo":1,"descricao":"Armadura Arcana (Padrão, 7 PM) O necromante recebe +7 na Defesa por um dia.","duracao":"Um dia","escola":"Necromancia","execucao":"Padrão (7 PM)","id":"armaduraArcana","nome":"Armadura Arcana","opcoes":[],"resistencia":"NA","tipo":"Arcana"},"comando":{"alcance":"Curto","alvo":"1 humanoide","circulo":1,"descricao":"Você dá uma ordem irresistível, que o alvo deve ser capaz de ouvir (mas não precisa entender). Se falhar na resistência, ele deve obedecer ao comando em seu próprio turno da melhor maneira possível. Escolha um dos efeitos. <br><br> **Fuja**: o alvo gasta seu turno se afastando de você (usando todas as suas ações). <br><br> **Largue**: o alvo solta quaisquer itens que esteja segurando e não pode pegá-los novamente até o início de seu próximo turno. Como esta é uma ação livre, ele ainda pode executar outras ações (exceto pegar aquilo que largou). <br><br> **Pare**: o alvo fica pasmo (apenas uma vez por cena). <br><br> **Senta**: com uma ação livre, o alvo senta no chão (se estava pendurado ou voando, desce até o chão). Ele pode fazer outras ações, mas não se levantar até o início de seu próximo turno. <br><br> **Venha**: o alvo gasta seu turno se aproximando de você (usando todas as suas ações).","duracao":"1 rodada","escola":"Encantamento","execucao":"Padrão","id":"comando","nome":"Comando","opcoes":[[1,"muda o alvo para 1 criatura."],[2,"aumenta a quantidade de alvos em +1."]],"resistencia":"Vontade anula","tipo":"Divina"},"compreensao":{"alcance":"Toque","alvo":"1 criatura ou texto","circulo":1,"descricao":"Essa magia lhe confere compreensão sobrenatural. Você pode tocar um texto e entender as palavras mesmo que não conheça o idioma. Se tocar numa criatura inteligente, pode se comunicar com ela mesmo que não tenham um idioma em comum. Se tocar uma criatura não inteligente, como um animal, pode perceber seus sentimentos.<br><br>Você também pode gastar uma ação de movimento para ouvir os pensamentos de uma criatura tocada (você “ouve” o que o alvo está pensando), mas um alvo involuntário tem direito a um teste de Vontade para proteger seus pensamentos e evitar este efeito.","duracao":"cena","escola":"Advinhação","execucao":"Padrão","id":"compreensao","nome":"Compreensão","opcoes":[[1,"muda o alcance para curto"],[2,"muda o alcance para curto e o alvo para criaturas escolhidas. Você pode entender todas as criaturas afetadas, mas só pode ouvir os pensamentos de uma por vez"],[2,"muda o alvo para 1 criatura. Em vez do normal, pode vasculhar os pensamentos do alvo para extrair informações. O alvo tem direito a um teste de Vontade para anular este efeito. O mestre decide se a criatura sabe ou não a informação que você procura. Requer 2º círculo."],[5,"muda o alcance para pessoal e o alvo para você. Em vez do normal, você pode falar, entender e escrever qualquer idioma. Requer 3º círculo."]],"resistencia":"Vontade anula","tipo":"Arcana"},"conjurarMonstro":{"alcance":"Curto","alvo":"NA","circulo":1,"descricao":"Você conjura um monstro Pequeno que ataca seus inimigos. Você escolhe a aparência do monstro e o tipo de dano que ele pode causar, entre corte, impacto e perfuração. No entanto, ele não é uma criatura real, e sim um construto feito de energia. Se for destruído, ou quando a magia acaba, desaparece com um brilho, sem deixar nada para trás. Você só pode ter um monstro conjurado por esta magia por vez. O monstro surge em um espaço desocupado a sua escolha dentro do alcance e age no início de cada um de seus turnos, a partir da próxima roda da. O monstro tem deslocamento 9m e pode fazer uma ação de movimento por rodada. Você pode gastar uma ação padrão para dar uma das seguintes ordens a ele. Mover: o monstro se movimenta o dobro do deslocamento nessa rodada. Atacar: o monstro causa 2d4+2 pontos de dano a uma criatura adjacente. Lançar Magia: o monstro pode servir como ponto de origem para uma magia lançada por você com execução de uma ação padrão ou menor. Ele pode descarregar um Toque Chocante em um inimigo distante, ou mesmo “cuspir” uma Bola de Fogo! Você gasta PM normalmente para lançar a magia. Outros usos criativos para monstros conjurados ficam a critério do mestre. O monstro não age sem receber uma ordem. Para efeitos de jogo, o monstro conjurado tem For 2, Des 3 e todos os outros atributos nulos. Ele tem Defesa igual a sua, 20 pontos de vid e usa o seu bônus para teste de Reflexos. Ele é imune a efeitos que pedem um teste de Fortitude ou Vontade.","duracao":"Sustentada","escola":"Convocação","execucao":"Completa","id":"conjurarMonstro","nome":"Conjurar Monstro","opcoes":[[1,"o monstro ganha deslocamento de escalada ou natação igual ao seu deslocamento terrestre."],[1,"aumenta o deslocamento do monstro em +3m."],[1,"muda o tipo de dano do ataque do monstro para ácido, fogo, frio ou eletricidade."],[2,"aumenta os PV do monstro em +10 para cada categoria de tamanho a partir de Pequeno (+10 PV para Pequeno, +20 PV para Médio etc.)."],[2,"aumenta o tamanho do monstro para Médio. Ele tem For 4, Des 3, 45 PV, deslocamento 12m e seu ataque causa 2d6+6 pontos de dano."],[2,"o monstro ganha resistência 5 contra dois tipos de dano (por exemplo, corte e frio)."],[4,"o monstro ganha uma nova ordem: Arma de Sopro. Para dar essa ordem você gasta 1 PM, e faz o monstro causar o dobro de seu dano de ataque em um cone de 6m a partir de si (Reflexos reduz à metade)."],[5,"aumenta o tamanho do monstro para Grande. Ele tem For 7, Des 2, 75 PV, deslocamento 12m e seu ataque causa 4d6+10 pontos de dano com 3m de alcance. Requer 2o círculo."],[9,"o monstro ganha deslocamento de voo igual ao dobro do deslocamento."],[9,"o monstro ganha imunidade contra dois tipos de dano."],[9,"aumenta o tamanho do monstro para Enorme. Ele tem For 11, Des 1, 110 PV, deslocamento 15m e seu ataque causa 4d8+15 pontos de dano com 4,5m de alcance. Requer 4o círculo."],[14,"aumenta o tamanho do monstro para Colossal. Ele tem For 15, Des 0, 180 PV, deslocamento 15m e seu ataque causa 4d12+20 pontos de dano com 9m de alcance. Requer 5o círculo."]],"resistencia":"NA","tipo":"Arcana"},"crânioVoador":{"alcance":"Médio","alvo":"1 Criatura","circulo":1,"descricao":"Crânio Voador (Padrão, 6 PM) Um crânio de energia negativa causa 6d8+6 pontos de dano de trevas em uma criatura em alcance médio e deixa todas as criaturas a 3m do alvo abaladas (Fortitude reduz à metade e evita a condição).","duracao":"Instantânea","escola":"Necromancia","execucao":"Padrão (6 PM)","id":"crânioVoador","nome":"Crânio Voador","opcoes":[],"resistencia":"Fortitude reduz à metade e evita a condição","tipo":"Arcana"},"curarFerimentos":{"alcance":"Toque","alvo":"1 criatura","circulo":1,"descricao":"Você canaliza luz que recupera 2d8+2 pontos de vida na criatura tocada.<br><br>Truque: muda o alvo para 1 morto-vivo. Em vez do normal, causa 1d8 pontos de dano de luz (Vontade reduz à metade).","duracao":"Instantânea","escola":"Evocação","execucao":"Padrão","id":"curarFerimentos","nome":"Curar Ferimentos","opcoes":[[1,"aumenta a cura em +1d8+1."],[2,"também remove uma condição de fadiga do alvo."],[2,"muda o alcance para curto."],[5,"muda o alcance para curto e o alvo para criaturas escolhidas."]],"resistencia":"","tipo":"Divina"},"enfeiticar":{"alcance":"Curto","alvo":"1 humanoide","circulo":1,"descricao":"O alvo fica enfeitiçado (veja a página 394). Um alvo hostil ou que esteja envolvido em um combate recebe +5 em seu teste de resistência. Se você ou seus aliados tomarem qualquer ação hostil contra o alvo, a magia é dissipada e o alvo retorna à atitude que tinha antes (ou piorada, de acordo com o mestre).","duracao":"Cena","escola":"Encantamento","execucao":"Padrão","id":"enfeiticar","nome":"Enfeitiçar","opcoes":[[2,"em vez do normal, você sugere uma ação para o alvo e ele obedece. A sugestão deve ser feita de modo que pareça aceitável, a critério do mestre. Pedir ao alvo que pule de um precipício, por exemplo, dissipa a magia. Já sugerir a um guarda que descanse um pouco, de modo que você e seus aliados passem por ele, é aceitável. Quando o alvo executa a ação, a magia termina. Você pode determinar uma condição específica para a sugestão: por exemplo, que um rico mercador doe suas moedas para o primeiro mendigo que encontrar."],[5,"muda o alvo para 1 espírito ou monstro. Requer 3o círculo."],[5,"afeta todos os alvos dentro do alcance."]],"resistencia":"Vontade anula","tipo":"Arcana"},"ergamSe":{"alcance":"Médio","alvo":"Nenhum","circulo":3,"descricao":"O necromante conjura seis mortos-vivos feitos de sombra em espaços desocupados em alcance curto. No turno do necromante, cada morto-vivo pode andar (deslocamento 9m) e causar dano a uma criatura adjacente (2d8 pontos de dano de trevas). Os mortos-vivos têm For 3, Des 3, Defesa 25 e todos os outros atributos nulos; eles têm 1 PV e falham automaticamente em qualquer teste de resistência ou oposto, mas são imunes a atordoamento, dano não letal, doença, encantamento, fadiga, frio, ilusão, paralisia, sono e veneno.","duracao":"Instantânea","escola":"Necromancia","execucao":"Padrão","id":"ergamSe","nome":"Ergam-se!","opcoes":[],"resistencia":"Não tem","tipo":"Arcana"},"escuridao":{"alcance":"Curto","alvo":"1 objeto","circulo":1,"descricao":"O alvo emana sombras em uma área com 6m de raio. Criaturas dentro da área recebem camuflagem leve por escuridão leve. As sombras não podem ser iluminadas por nenhuma fonte de luz natural. O objeto pode ser guardado (em um bolso, por exemplo) para interromper a escuridão, que voltará a funcionar caso o objeto seja revelado. Se lançar a magia num objeto de uma criatura involuntária, ela tem direito a um teste de Vontade para anulá-la. Escuridão anula Luz.","duracao":"Cena","escola":"Necromancia","execucao":"Padrão","id":"escuridao","nome":"Escuridão","opcoes":[[1,"aumenta a área da escuridão em +1,5m de raio."],[2,"muda o efeito para fornecer camuflagem total por escuridão total. As sombras bloqueiam a visão na área e através dela."],[2,"muda o alvo para 1 criatura e a resistência para Fortitude parcial. Você lança a magia nos olhos do alvo, que fica cego pela cena. Se passar na resistência, fica cego por 1 rodada.Requer 2º círculo."],[3,"muda a duração para um dia."],[5,"muda o alcance para pessoal e o alvo para você. Em vez do normal, você é coberto por sombras, recebendo +10 em testes de Furtividade e camuflagem leve. Requer 2º círculo."]],"resistencia":"Vontade anula","tipo":"Mista"},"explosaoDeChamas":{"alcance":"Pessoal (Cone de 6m)","alvo":"Todos no alcance","circulo":1,"descricao":"Um leque de chamas irrompe de suas mãos, causando 2d6 pontos de dano de fogo às criaturas na área.<br><br>Truque: muda o alcance para curto, a área para alvo de 1 objeto e a resistência para Reflexos anula. Você gera uma pequena explosão que não causa dano mas pode acender uma vela, tocha ou fogueira. Também pode fazer um objeto inflamável com RD 0 (como uma corda ou pergaminho) ficar em chamas. Uma criatura em posse de um objeto pode evitar esse efeito se passar no teste de resistência.","duracao":"Instatânea","escola":"Evocação","execucao":"Padrão","id":"explosaoDeChamas","nome":"Explosão de chamas","opcoes":[[1,"aumenta o dano em +1d6."],[1,"muda a resistência para Reflexos parcial. Se passar, a criatura reduz o dano à metade; se falhar, fica em chamas (veja Condições, na página 394)."]],"resistencia":"Reflexos reduz à metade","tipo":"Arcana"},"infligirFerimentos":{"alcance":"Toque","alvo":"1 criatura","circulo":1,"descricao":"Você canaliza energia negativa contra um alvo, causando 2d8+2 pontos de dano de trevas (ou curando 2d8+2 PV, se for um morto-vivo). Infligir Ferimentos anula Curar Ferimentos.","duracao":"Instantânea","escola":"Necromancia","execucao":"Padrão","id":"infligirFerimentos","nome":"Infligir Ferimentos","opcoes":[[1,"além do normal, se falhar na resistência, o alvo fica fraco pela cena."],[2,"aumenta o dano em 1d8+1."],[2,"muda a resistência para nenhum. Como parte da execução da magia, você pode fazer um ataque corpo a corpo contra o alvo. Se acertar, causa o dano do ataque e o efeito da magia."],[5,"muda o alcance para curto e o alvo para criaturas escolhidas."]],"resistencia":"Fortitude reduz à metade","tipo":"Divina"},"luzArcana":{"alcance":"Curto","alvo":"1 objeto","circulo":1,"descricao":"O alvo emite luz (mas não produz calor) em uma área com 6m de raio. O objeto pode ser guardado (em um bolso, por exemplo) para interromper a luz, que voltará a funcionar caso o objeto seja revelado. Se lançar a magia num objeto de uma criatura involuntária, ela tem direito a um teste de Vontade para anulá-la. Luz anula Escuridão.","duracao":"Cena","escola":"Evocação","execucao":"Padrão","id":"luzArcana","nome":"Luz Arcana","opcoes":[[1,"aumenta a área iluminada em +3m de raio."],[2,"muda a duração para um dia."],[2,"muda a duração para permanente e adiciona componente material (pó de rubi no valor de X$ 50). Não pode ser usado em conjunto com outros aprimoramentos. Requer 2º círculo."],[0,"(Apenas Arcanos): muda o alvo para 1 criatura. Você lança a magia nos olhos do alvo, que fica ofuscado pela cena. Não afeta criaturas cegas"],[2,"(Apenas Arcanos): muda o alcance para longo e o efeito para cria 4 pequenos globos flutuantes de pura luz. Você pode posicionar os globos onde quiser dentro do alcance. Você pode enviar um à frente, outra para trás, outra para cima e manter um perto de você, por exemplo. Uma vez por rodada, você pode mover os globos com uma ação livre. Cada um ilumina como uma tocha, mas não produz calor. Se um globo ocupar o espaço de uma criatura, ela fica ofuscada e sua silhueta pode ser vista claramente (ela não recebe camuflagem por escuridão ou invisibilidade). Requer 2º círculo."]],"resistencia":"Vontade anula","tipo":"Arcana"},"luzDivina":{"alcance":"Curto","alvo":"1 objeto","circulo":1,"descricao":"O alvo emite luz (mas não produz calor) em uma área com 6m de raio. O objeto pode ser guardado (em um bolso, por exemplo) para interromper a luz, que voltará a funcionar caso o objeto seja revelado. Se lançar a magia num objeto de uma criatura involuntária, ela tem direito a um teste de Vontade para anulá-la. Luz anula Escuridão.","duracao":"Cena","escola":"Evocação","execucao":"Padrão","id":"luzDivina","nome":"Luz Divina","opcoes":[[1,"aumenta a área iluminada em +3m de raio."],[2,"muda a duração para um dia."],[2,"muda a duração para permanente e adiciona componente material (pó de rubi no valor de X$ 50). Não pode ser usado em conjunto com outros aprimoramentos. Requer 2º círculo."],[2,"(Apenas Divinos): a luz é cálida como a do sol. Criaturas que sofrem penalidades e dano pela luz solar sofrem seus efeitos como se estivessem expostos à luz solar real. Seus aliados na área estabilizam automaticamente e ficam imunes à condição sangrando, e seus inimigos ficam ofuscados. Requer 2º círculo."],[2,"(Apenas Divinos): muda o alcance para toque e o alvo para 1 criatura. Em vez do normal, o alvo é envolto por um halo de luz, recebendo +10 em testes de Diplomacia e redução de trevas 10. Requer 2º círculo."]],"resistencia":"Vontade anula","tipo":"Divina"},"toqueVampírico":{"alcance":"Toque","alvo":"1 Criatura","circulo":1,"descricao":"Toque Vampírico (Padrão, 6 PM) O necromante toca em uma criatura e causa 10d6 pontos de dano de trevas (Fortitude reduz à metade) e recupera pontos de vida iguais à metade do dano causado.","duracao":"Instantânea","escola":"Necromancia","execucao":"Padrão (6 PM)","id":"toqueVampírico","nome":"Toque Vampírico","opcoes":[],"resistencia":"Fortitude reduz à metade","tipo":"Arcana"},"transmutarObjetos":{"alcance":"Toque","alvo":"Materia Prima","circulo":1,"descricao":"A magia transforma matéria bruta para moldar um novo objeto. Você pode usar matéria-prima mundana para criar um objeto de tamanho Pequeno ou menor e preço máximo de T$ 25, como um balde ou uma espada. O objeto reverte à matéria-prima no final da cena, ou se for tocado por um objeto feito de chumbo. Esta magia não pode ser usada para criar objetos consumíveis, como alimentos ou itens alquímicos, nem objetos com mecanismos complexos, como bestas ou armas de fogo. Transmutar Objetos anula Despedaçar. Truque: muda o alvo para 1 objeto mundano Mínusculo (ou material em quantidade equivalente) e a duração para instantânea. Em vez do normal, você pode alterar as propriedades físicas do alvo, como colorir, limpar ou sujar itens pequenos (incluindo peças de roupa), aquecer, esfriar e/ou temperar (mas não produzir) ou curar 1 PV do objeto, consertando pequenas falhas como colar um frasco de cerâmica quebrado, unir os elos de uma corrente ou costurar uma roupa rasgada. Um objeto só pode ser afetado por este truque uma vez por dia.","duracao":"Cena","escola":"Transmutação","execucao":"Padrão","id":"transmutarObjetos","nome":"Transmutar Objetos","opcoes":[[1,"muda o alcance para toque, o alvo para 1 construto e a duração para instantânea. Em vez do normal, cura 2d8 PV do alvo. Você pode gastar 2 PM adicionais para aumentar a cura em +1d8. +2 PM: aumenta o limite de tamanho do objeto em uma categoria."],[3,"aumenta o preço máximo do objeto criado em um fator de x10 (+3 PM por T$ 250 de preço, +6 PM por T$ 2.500 de preço e assim por diante)."],[5,"muda o alvo para 1 objeto mundano e a duração para instantânea. Em vez do normal, você cura todos os PV do alvo, restaurando o objeto totalmente. Este aprimoramento está sujeito aos limites de tamanho e preço do objeto conforme a magia original e não funciona se o objeto tiver sido completamente destruído (queimado até virar cinzas ou desintegrado, por exemplo). Requer 3o círculo."],[9,"como o aprimoramento anterior, mas passa a afetar itens mágicos."]],"resistencia":"Não tem","tipo":"Arcana"}}
